local/adding_features_to_lox.org
#+SETUPFILE: ../basic-setup.org 
#+TITLE: Adding Features To Lox
#+DATE: <2021-08-19 Thu> 
Finally, I got time to sit down and implement a tree-walk interpreter following Bob Nystrom's [[https://craftinginterpreters.com/][Crafting Interpreters]]. In this post, I'm going to explain some of the features I have added to the language. You can find my complete implementation [[https://github.com/veera-sivarajan/lang0][here]]. I have also made a [[https://youtu.be/0P6VPOIKATg][video]] demoing the features listed below.

*Note:* This post assumes that the reader has read Part II of Crafting Interpreters and is familiar with the implementation details. 
* Anonymous Functions
By definition, anonymous functions or lambdas are functions without an associated name. They are used when the user wants to invoke a piece of code but don't want to reuse it. This feature also solves challenge #2 in chapter 10 /Functions/. In my implementation, a lambda can be written by using the ~lambda~ keyword followed by the parameters inside parentheses and the body of the function in braces.
#+BEGIN_SRC lox
// lambdas in lox
var square = lambda(num) { return num * num; };
print square(5); // 25
#+END_SRC
A lambda is a primary expression that gets evaluated to a value of type ~LambdaFunction~. Parsing it is exactly like parsing a function declaration but here the parser does not consume a name for the function. Finally, it wraps the parameters and the body of lambda in a AST node. 
#+BEGIN_SRC cpp
std::shared_ptr<Expr> Parser::lambda() {
    consume(TokenType::LEFT_PAREN, "Expect '(' after 'lambda'.");
    std::vector<Token> parameters;
    if (!check(TokenType::RIGHT_PAREN)) {
        do {
            if (parameters.size() >= 10) {
                error(peek(), "Can't have more than 10 parameters.");
            }
            parameters.push_back(
                consume(TokenType::IDENTIFIER, "Expect parameter name."));
        } while (match(TokenType::COMMA));
    }
    consume(TokenType::RIGHT_PAREN, "Expect ')' after parameters.");
    consume(TokenType::LEFT_BRACE, "Expect '{' before lambda body.");
    std::vector<std::shared_ptr<Statement::Stmt>> body = block();
    return std::make_shared<Lambda>(std::move(parameters), std::move(body));
}
#+END_SRC
Since these expressions don't have a name and cannot be reused like a variable or a named function, the interpreter need not store the value of the function in its environment. Instead it would create a runtime's representation of an anonymous function using the parsed value and the environment of the lambda (to allow closures to work) and return the value.
#+BEGIN_SRC cpp
std::any Interpreter::visitLambdaExpr(std::shared_ptr<Lambda> expr) {
    return std::make_shared<LambdaFunction>(expr, curr_env);
}
#+END_SRC
* Lists
To add a list data type into the language, the task can be divided into three small tasks:
** Scanning
Introduce two new tokens to make the scanner handle list expressions and subscripts.
#+BEGIN_SRC cpp
case '[': addToken(TokenType::LEFT_BRACKET); break;
case ']': addToken(TokenType::RIGHT_BRACKET); break;
#+END_SRC
** Creating List Literals
Like numbers, string, ~true~ and ~false~, a list is a primary expression which can contain any number of comma seperated expressions. Since Lox is a dynamically typed language, these expressions can be of any type. 

To learn about the grammar for lists, I found Caleb's blog [[https://calebschoepp.com/blog/2020/adding-a-list-data-type-to-lox/][post]] to be helpful. It explained all the details related to implementing lists in a clear and concise way.
*** Parsing Lists
 Parsing a list literal is exactly like parsing the arguments of a function call but here square brackets replaces the parentheses. Internally, the parser stores a list as a vector containing expressions. The function first checks if it is a empty list. If its not, it parses each expression in the scanned list and appends it to the internal representation. In the end, it consumes the ~]~ and wraps the vector in a AST node.
#+BEGIN_SRC cpp
std::shared_ptr<Expr> Parser::list() {
    std::vector<std::shared_ptr<Expr>> values = {};
    if (match(TokenType::RIGHT_BRACKET)) {
        return std::make_shared<List>(values);
    } else {
        do {
            if (values.size() >= 100) {
                error(peek(), "Can't have more than 100 elements in a list.");
            }
            std::shared_ptr<Expr> value = logicalOr();
            values.push_back(value);
        } while (match(TokenType::COMMA));
    }
    consume(TokenType::RIGHT_BRACKET, "Expect ']' at end of list.");
    return std::make_shared<List>(values);
}
#+END_SRC
*** Interpreting Lists
To interpret a list literal, the interpreter iterates through each element in the parsed expression, evaluates it and appends the value to runtime's representation of a list. Finally, like interpreting any other kind of expression, the runtime's value is returned. 
#+BEGIN_SRC cpp
std::any Interpreter::visitListExpr(std::shared_ptr<List> expr) {
    auto list = std::make_shared<ListType>();
    for (std::shared_ptr<Expr> &value : expr->values) {
        list->append(evaluate(value));
    }
    return list;
}
#+END_SRC
