docs/adding_features_to_lox.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-Nov-26 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Adding Features To Lox</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Veera Sivarajan">
<link rel="stylesheet" type="text/css" href="./css/style.css"/>
</head>
<body>
<header id="top" class="status">
<nav>
  <a href="https://github.com/veera-sivarajan">Github</a>
  <a href="/">Home</a>
  <a href="/about/">About</a>
  <a href="mailto:sveera.2001@gmail.com">Email</a>
</nav>  
</header>
<main id="content">
<header>
<h1 class="title">Adding Features To Lox</h1>
<p class="subtitle">2021-Aug-19</p>
</header><p>
Finally, I got time to sit down and implement a tree-walk interpreter following Bob Nystrom&rsquo;s <a href="https://craftinginterpreters.com/">Crafting Interpreters</a>. In this post, I&rsquo;m going to explain some of the features I have added to the language. You can find my complete implementation <a href="https://github.com/veera-sivarajan/lang0">here</a>. I have also made a <a href="https://youtu.be/0P6VPOIKATg">video</a> demoing the features listed below.
</p>

<p>
<b>Note:</b> This post assumes that the reader has read Part II of Crafting Interpreters and is familiar with the implementation details. 
</p>
<section id="outline-container-org856a920" class="outline-2">
<h2 id="org856a920">Anonymous Functions</h2>
<div class="outline-text-2" id="text-org856a920">
<p>
By definition, anonymous functions or lambdas are functions without an associated name. They are used when the user wants to invoke a piece of code but don&rsquo;t want to reuse it. This feature also solves challenge #2 in chapter 10 <i>Functions</i>. In my implementation, a lambda can be written by using the <code>lambda</code> keyword followed by the parameters inside parentheses and the body of the function in braces.
</p>
<div class="org-src-container">
<pre class="src src-lox">// lambdas in lox
var square = lambda(num) { return num * num; };
print square(5); // 25
</pre>
</div>
<p>
A lambda is a primary expression that gets evaluated to a value of type <code>LambdaFunction</code>. Parsing it is exactly like parsing a function declaration but here the parser does not consume a name for the function. Finally, it wraps the parameters and the body of lambda in a AST node. 
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span class="org-constant">std</span>::<span class="org-type">shared_ptr</span>&lt;Expr&gt; <span class="org-constant">Parser</span>::<span class="org-function-name">lambda</span>() {
    consume(<span class="org-constant">TokenType</span>::LEFT_PAREN, <span class="org-string">"Expect '(' after 'lambda'."</span>);
    <span class="org-constant">std</span>::<span class="org-type">vector</span>&lt;Token&gt; <span class="org-variable-name">parameters</span>;
    <span class="org-keyword">if</span> (<span class="org-negation-char">!</span>check(<span class="org-constant">TokenType</span>::RIGHT_PAREN)) {
        <span class="org-keyword">do</span> {
            <span class="org-keyword">if</span> (parameters.size() &gt;= 10) {
                error(peek(), <span class="org-string">"Can't have more than 10 parameters."</span>);
            }
            parameters.push_back(
                consume(<span class="org-constant">TokenType</span>::IDENTIFIER, <span class="org-string">"Expect parameter name."</span>));
        } <span class="org-keyword">while</span> (match(<span class="org-constant">TokenType</span>::COMMA));
    }
    consume(<span class="org-constant">TokenType</span>::RIGHT_PAREN, <span class="org-string">"Expect ')' after parameters."</span>);
    consume(<span class="org-constant">TokenType</span>::LEFT_BRACE, <span class="org-string">"Expect '{' before lambda body."</span>);
    <span class="org-constant">std</span>::<span class="org-type">vector</span>&lt;<span class="org-constant">std</span>::<span class="org-type">shared_ptr</span>&lt;<span class="org-constant">Statement</span>::Stmt&gt;&gt; <span class="org-variable-name">body</span> = block();
    <span class="org-keyword">return</span> <span class="org-constant">std</span>::make_shared&lt;Lambda&gt;(<span class="org-constant">std</span>::move(parameters), <span class="org-constant">std</span>::move(body));
}
</pre>
</div>
<p>
Since these expressions don&rsquo;t have a name and cannot be reused like a variable or a named function, the interpreter need not store the value of the function in its environment. Instead it would create a runtime&rsquo;s representation of an anonymous function using the parsed value and the environment of the lambda (to allow closures to work) and return the value.
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span class="org-constant">std</span>::<span class="org-type">any</span> <span class="org-constant">Interpreter</span>::<span class="org-function-name">visitLambdaExpr</span>(<span class="org-constant">std</span>::<span class="org-type">shared_ptr</span>&lt;Lambda&gt; <span class="org-variable-name">expr</span>) {
    <span class="org-keyword">return</span> <span class="org-constant">std</span>::make_shared&lt;LambdaFunction&gt;(expr, curr_env);
}
</pre>
</div>
</div>
</section>
<section id="outline-container-org6fb4523" class="outline-2">
<h2 id="org6fb4523">Lists</h2>
<div class="outline-text-2" id="text-org6fb4523">
<p>
To add a list data type into the language, the task can be divided into three small tasks:
</p>
</div>
<div id="outline-container-org570b9a6" class="outline-3">
<h3 id="org570b9a6">Scanning</h3>
<div class="outline-text-3" id="text-org570b9a6">
<p>
Introduce two new tokens to make the scanner handle list expressions and subscripts.
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span class="org-keyword">case</span> <span class="org-string">'['</span>: addToken(<span class="org-constant">TokenType</span>::LEFT_BRACKET); <span class="org-keyword">break</span>;
<span class="org-keyword">case</span> <span class="org-string">']'</span>: addToken(<span class="org-constant">TokenType</span>::RIGHT_BRACKET); <span class="org-keyword">break</span>;
</pre>
</div>
</div>
</div>
<div id="outline-container-orga150fe9" class="outline-3">
<h3 id="orga150fe9">Creating List Literals</h3>
<div class="outline-text-3" id="text-orga150fe9">
<p>
Like numbers, string, <code>true</code> and <code>false</code>, a list is a primary expression which can contain any number of comma seperated expressions. Since Lox is a dynamically typed language, these expressions can be of any type. 
</p>

<p>
To learn about the grammar for lists, I found Caleb&rsquo;s blog <a href="https://calebschoepp.com/blog/2020/adding-a-list-data-type-to-lox/">post</a> to be helpful. It explained all the details related to implementing lists in a clear and concise way.
</p>
</div>
<div id="outline-container-orgd479be1" class="outline-4">
<h4 id="orgd479be1">Parsing Lists</h4>
<div class="outline-text-4" id="text-orgd479be1">
<p>
Parsing a list literal is exactly like parsing the arguments of a function call but here square brackets replaces the parentheses. Internally, the parser stores a list as a vector containing expressions. The function first checks if it is a empty list. If its not, it parses each expression in the scanned list and appends it to the internal representation. In the end, it consumes the <code>]</code> and wraps the vector in a AST node.
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span class="org-constant">std</span>::<span class="org-type">shared_ptr</span>&lt;Expr&gt; <span class="org-constant">Parser</span>::<span class="org-function-name">list</span>() {
    <span class="org-constant">std</span>::<span class="org-type">vector</span>&lt;<span class="org-constant">std</span>::<span class="org-type">shared_ptr</span>&lt;Expr&gt;&gt; <span class="org-variable-name">values</span> = {};
    <span class="org-keyword">if</span> (match(<span class="org-constant">TokenType</span>::RIGHT_BRACKET)) {
        <span class="org-keyword">return</span> <span class="org-constant">std</span>::make_shared&lt;List&gt;(values);
    } <span class="org-keyword">else</span> {
        <span class="org-keyword">do</span> {
            <span class="org-keyword">if</span> (values.size() &gt;= 100) {
                error(peek(), <span class="org-string">"Can't have more than 100 elements in a list."</span>);
            }
            <span class="org-constant">std</span>::<span class="org-type">shared_ptr</span>&lt;Expr&gt; <span class="org-variable-name">value</span> = logicalOr();
            values.push_back(value);
        } <span class="org-keyword">while</span> (match(<span class="org-constant">TokenType</span>::COMMA));
    }
    consume(<span class="org-constant">TokenType</span>::RIGHT_BRACKET, <span class="org-string">"Expect ']' at end of list."</span>);
    <span class="org-keyword">return</span> <span class="org-constant">std</span>::make_shared&lt;List&gt;(values);
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb7f2167" class="outline-4">
<h4 id="orgb7f2167">Interpreting Lists</h4>
<div class="outline-text-4" id="text-orgb7f2167">
<p>
To interpret a list literal, the interpreter iterates through each element in the parsed expression, evaluates it and appends the value to runtime&rsquo;s representation of a list. Finally, like interpreting any other kind of expression, the runtime&rsquo;s value is returned. 
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span class="org-constant">std</span>::<span class="org-type">any</span> <span class="org-constant">Interpreter</span>::<span class="org-function-name">visitListExpr</span>(<span class="org-constant">std</span>::<span class="org-type">shared_ptr</span>&lt;List&gt; <span class="org-variable-name">expr</span>) {
    <span class="org-keyword">auto</span> <span class="org-variable-name">list</span> = <span class="org-constant">std</span>::make_shared&lt;ListType&gt;();
    <span class="org-keyword">for</span> (<span class="org-constant">std</span>::<span class="org-type">shared_ptr</span>&lt;Expr&gt; &amp;<span class="org-variable-name">value</span> : expr-&gt;values) {
        list-&gt;append(evaluate(value));
    }
    <span class="org-keyword">return</span> list;
}
</pre>
</div>
</div>
</div>
</div>
