local/adding_features_to_lox.org
** Handling Subscript Expressions
Subscript expressions are used to get and set an element at a particular index in the list. In other words, they can be used both as a l-value and a r-value and to diffrentiate between the two and also to avoid repetition of code I have used a simple trick[fn::I'm not sure if this would work when classes and methods are implemented.].

From the interpreter's point of view, the only difference between the two is the presence of a value expression. If the AST node has a value, it should assign it at index. Otherwise, it should return the value at index. So the trick is to make the parser pass a =nullptr= in the place of value expression when parsing a r-value and pass a value only when parsing a l-value. This allows the interpreter to easily differentiate between the two kinds of subscript expressions.
*** Parsing Subscripts
Parsing the r-value is, once again, similar to parsing a function call. But instead of parsing any number of arguments, the parser will only parse a single value between the square brackets. ~subscript()~ calls ~finishSubscript()~ each time it sees a ~[~ to support indexing list of lists. Lastly, to wrap everything in a node, the parser stores a =nullptr= in the place of value expression to let the interpreter know that it is a r-value. 
#+BEGIN_SRC cpp
std::shared_ptr<Expr> Parser::finishSubscript(std::shared_ptr<Expr> name) {
    std::shared_ptr<Expr> index = logicalOr();
    Token paren = consume(TokenType::RIGHT_BRACKET,
                          "Expect ']' after arguments.");
    return std::make_shared<Subscript>(name, index, nullptr, paren);
}

std::shared_ptr<Expr> Parser::subscript() {
    std::shared_ptr<Expr> expr = primary();
    while (true) {
        if (match(TokenType::LEFT_BRACKET)) {
            expr = finishSubscript(expr);
        } else {
            break;
        }
    }
    return expr;
}
#+END_SRC
As you may have noticed in the formal grammar, for parsing a l-value expression, the parser extends the ~assignment~ rule. If the parsed expression is of type ~Subscript~, it wraps the list's name, index and value expression in a AST node. The list's name is stored as an expression without converting it into l-value because the methods used for manipulating the list act on a evaluated value of the list. 
#+BEGIN_SRC cpp
  std::shared_ptr<Expr> Parser::assignment() {
      std::shared_ptr<Expr> expr = logicalOr();
      if (match(TokenType::EQUAL)) {
          Token equals = previous();
          std::shared_ptr<Expr> value = assignment();
          // parse variable assignment
          } else if (Subscript *s = dynamic_cast<Subscript *>(expr.get())) {
              return std::make_shared<Subscript>(s->name, s->index, value,
                                                 s->paren);
          }
          error(std::move(equals), "Invalid assignment target.");
      }
      return expr;
  }
#+END_SRC
