docs/adding_features_to_lox.html
<div id="outline-container-org9268e5f" class="outline-3">
<h3 id="org9268e5f">Handling Subscript Expressions</h3>
<div class="outline-text-3" id="text-org9268e5f">
<p>
Subscript expressions are used to get and set an element at a particular index in the list. In other words, they can be used both as a l-value and a r-value and to diffrentiate between the two and also to avoid repetition of code I have used a simple trick<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>.
</p>

<p>
From the interpreter&rsquo;s point of view, the only difference between the two is the presence of a value expression. If the AST node has a value, it should assign it at index. Otherwise, it should return the value at index. So the trick is to make the parser pass a <code>nullptr</code> in the place of value expression when parsing a r-value and pass a value only when parsing a l-value. This allows the interpreter to easily differentiate between the two kinds of subscript expressions.
</p>
</div>
<div id="outline-container-orgf59c3a6" class="outline-4">
<h4 id="orgf59c3a6">Parsing Subscripts</h4>
<div class="outline-text-4" id="text-orgf59c3a6">
<p>
Parsing the r-value is, once again, similar to parsing a function call. But instead of parsing any number of arguments, the parser will only parse a single value between the square brackets. <code>subscript()</code> calls <code>finishSubscript()</code> each time it sees a <code>[</code> to support indexing list of lists. Lastly, to wrap everything in a node, the parser stores a <code>nullptr</code> in the place of value expression to let the interpreter know that it is a r-value. 
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span class="org-constant">std</span>::<span class="org-type">shared_ptr</span>&lt;Expr&gt; <span class="org-constant">Parser</span>::<span class="org-function-name">finishSubscript</span>(<span class="org-constant">std</span>::<span class="org-type">shared_ptr</span>&lt;Expr&gt; <span class="org-variable-name">name</span>) {
    <span class="org-constant">std</span>::<span class="org-type">shared_ptr</span>&lt;Expr&gt; <span class="org-variable-name">index</span> = logicalOr();
    <span class="org-type">Token</span> <span class="org-variable-name">paren</span> = consume(<span class="org-constant">TokenType</span>::RIGHT_BRACKET,
                          <span class="org-string">"Expect ']' after arguments."</span>);
    <span class="org-keyword">return</span> <span class="org-constant">std</span>::make_shared&lt;Subscript&gt;(name, index, <span class="org-constant">nullptr</span>, paren);
}

<span class="org-constant">std</span>::<span class="org-type">shared_ptr</span>&lt;Expr&gt; <span class="org-constant">Parser</span>::<span class="org-function-name">subscript</span>() {
    <span class="org-constant">std</span>::<span class="org-type">shared_ptr</span>&lt;Expr&gt; <span class="org-variable-name">expr</span> = primary();
    <span class="org-keyword">while</span> (<span class="org-constant">true</span>) {
        <span class="org-keyword">if</span> (match(<span class="org-constant">TokenType</span>::LEFT_BRACKET)) {
            expr = finishSubscript(expr);
        } <span class="org-keyword">else</span> {
            <span class="org-keyword">break</span>;
        }
    }
    <span class="org-keyword">return</span> expr;
}
</pre>
</div>
<p>
As you may have noticed in the formal grammar, for parsing a l-value expression, the parser extends the <code>assignment</code> rule. If the parsed expression is of type <code>Subscript</code>, it wraps the list&rsquo;s name, index and value expression in a AST node. The list&rsquo;s name is stored as an expression without converting it into l-value because the methods used for manipulating the list act on a evaluated value of the list. 
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span class="org-constant">std</span>::<span class="org-type">shared_ptr</span>&lt;Expr&gt; <span class="org-constant">Parser</span>::<span class="org-function-name">assignment</span>() {
    <span class="org-constant">std</span>::<span class="org-type">shared_ptr</span>&lt;Expr&gt; <span class="org-variable-name">expr</span> = logicalOr();
    <span class="org-keyword">if</span> (match(<span class="org-constant">TokenType</span>::EQUAL)) {
        <span class="org-type">Token</span> <span class="org-variable-name">equals</span> = previous();
        <span class="org-constant">std</span>::<span class="org-type">shared_ptr</span>&lt;Expr&gt; <span class="org-variable-name">value</span> = assignment();
        <span class="org-comment-delimiter">// </span><span class="org-comment">parse variable assignment</span>
        } <span class="org-keyword">else</span> <span class="org-keyword">if</span> (<span class="org-type">Subscript</span> *<span class="org-variable-name">s</span> = <span class="org-keyword">dynamic_cast</span>&lt;<span class="org-type">Subscript</span> *&gt;(expr.get())) {
            <span class="org-keyword">return</span> <span class="org-constant">std</span>::make_shared&lt;<span class="org-type">Subscript</span>&gt;(s-&gt;name, s-&gt;index, value,
                                               s-&gt;paren);
        }
        error(<span class="org-constant">std</span>::move(equals), <span class="org-string">"Invalid assignment target."</span>);
    }
    <span class="org-keyword">return</span> expr;
}
</pre>
</div>
</div>
</div>
