local/adding_features_to_lox.org
*** Interpreting Subscripts
To interpret a subscript expression, the interpreter first evaluates the list's name and index and checks if they are of the correct type. If they pass the type checks, the interpreter casts the list's name to the runtime's representation of a list and the index to ~int~ from ~double~[fn::This is actually a bug because index number should not be of type ~double~]. Checking if the index is out of range is done at the last moment as they should be handled differently for l-value and r-value. 

Now the interpreter knows that the list and the index are of valid types and is ready interpret it. If the AST node has a value expression, the interpreter evaluates it and assigns it at the index. List's ~setAtIndex()~ method sets a value at a index under two condtions:
- When index is equivalent to length of list: To append a value to the list.
- When index is less than length of list and greater than zero: To assign a value at a index. 
If neither of those conditions evaluate to a truthy value, the method returns ~false~ and the interpreter throws a runtime error. 

If the node does *not* have a value it's a r-value and the interpreter is supposed to return the value at index. It returns the value using the list's method if index is within the range of the list. Otherwise, if the index is out of range, it returns a =nullptr=.
#+BEGIN_SRC cpp
std::any Interpreter::visitSubscriptExpr(std::shared_ptr<Subscript> expr) {
    std::any name = evaluate(expr->name);
    std::any index = evaluate(expr->index);
    if (name.type() == typeid(std::shared_ptr<ListType>)) {
        if (index.type() == typeid(double)) {
            std::shared_ptr<ListType> list;
            int castedIndex;
            list = std::any_cast<std::shared_ptr<ListType>>(name);
            castedIndex = std::any_cast<double>(index);
            if (expr->value != nullptr) {
                std::any value = evaluate(expr->value);
                if (list->setAtIndex(castedIndex, value)) {
                    return value; 
                } else {
                    throw RuntimeError{expr->paren, "Index out of range."};
                }
            } else {
                if (castedIndex >= list->length() || castedIndex < 0) {
                    return nullptr;
                }
                return list->getEleAt(castedIndex);
            }
        } else {
            throw RuntimeError{expr->paren, "Index should be of type int."};
        }
    } else {
        throw RuntimeError{expr->paren, "Only lists can be subscripted."};
    }
    return {};
}
#+END_SRC
I could have made the interpreter throw errors when indexing out of range but chose to return a =nullptr= because it helps in terminating a loop while iterating over a list. It might seem unsafe but the interpreter throws an error when a variable initialized with =nullptr= is used in an expression. So if the user tries to access a value out of range and uses it in some other expression, the program is guaranteed to fail. 
#+BEGIN_SRC lox
// lox script to print all elements in a list
var list = [1, 2, 3, 4, 5];
for (var i = 0; list[i] != nil; i = i + 1) {
    print list[i]; // 1 2 3 4 5
}
#+END_SRC
* Unused Variable Warnings
I also made the resolver throw warnings when there are unused variables in the local scope. This also solves challenge #3 in chapter 11 /Resolving and Binding/.

To implement this feature, a vector of ~std::map~ is used like a stack to track the nested (possibly) local scopes in scope. This is similar to the =scopes= stack used in the resolver but instead of storing a string and a boolean, here I store the variable as a token and the number of times it has been resolved. When the resolver enters a local scope it pushes an empty map into the vector and when it exits a scope it pops a map. Declaring a variable in the local scope inserts a element with variable token as key and =0= as value in the top most map. This value gets incremented by one whenever the corresponding variable is resolved locally. Finally, before exiting a local scope calling =checkUnusedVariables()= would iterate over all the pairs in the top most map and throw a warning when the value is equivalent to zero.
#+BEGIN_SRC cpp
void Resolver::checkUnusedVariables() {
    std::map<Token, int> &currentScope = identifiers.back();
    for (auto const& [key, val] : currentScope) {
        if (val == 0) {
            Error::warn(key, "Unused local variable.");
        }
    }
}
#+END_SRC
* Epilogue
I had so much fun working on this project and learnt a lot about programming languages and interpreters. Before reading this book, I did not know what actually happens when I run or compile my programs but now I have a better understanding of the underlying ideas and visualize a interpreter as follows:

1. Scanner:
   Converts user input into list of tokens.
2. Parser:
   Tokens into expression or statement AST node based on formal grammar.
3. Interpreter:
   - Evaluates a expression node to a value.
   - Executes a statement node to produce side effect.
4. Environment:
   Stores the state of the program.

Next, I'm looking forward to start working on the bytecode interpreter.

