docs/adding_features_to_lox.html
<div id="outline-container-orge106fde" class="outline-4">
<h4 id="orge106fde">Interpreting Subscripts</h4>
<div class="outline-text-4" id="text-orge106fde">
<p>
To interpret a subscript expression, the interpreter first evaluates the list&rsquo;s name and index and checks if they are of the correct type. If they pass the type checks, the interpreter casts the list&rsquo;s name to the runtime&rsquo;s representation of a list and the index to <code>int</code> from <code>double</code><sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>. Checking if the index is out of range is done at the last moment as they should be handled differently for l-value and r-value. 
</p>

<p>
Now the interpreter knows that the list and the index are of valid types and is ready interpret it. If the AST node has a value expression, the interpreter evaluates it and assigns it at the index. List&rsquo;s <code>setAtIndex()</code> method sets a value at a index under two condtions:
</p>
<ul class="org-ul">
<li>When index is equivalent to length of list: To append a value to the list.</li>
<li>When index is less than length of list and greater than zero: To assign a value at a index.</li>
</ul>
<p>
If neither of those conditions evaluate to a truthy value, the method returns <code>false</code> and the interpreter throws a runtime error. 
</p>

<p>
If the node does <b>not</b> have a value it&rsquo;s a r-value and the interpreter is supposed to return the value at index. It returns the value using the list&rsquo;s method if index is within the range of the list. Otherwise, if the index is out of range, it returns a <code>nullptr</code>.
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span class="org-constant">std</span>::<span class="org-type">any</span> <span class="org-constant">Interpreter</span>::<span class="org-function-name">visitSubscriptExpr</span>(<span class="org-constant">std</span>::<span class="org-type">shared_ptr</span>&lt;Subscript&gt; <span class="org-variable-name">expr</span>) {
    <span class="org-constant">std</span>::<span class="org-type">any</span> <span class="org-variable-name">name</span> = evaluate(expr-&gt;name);
    <span class="org-constant">std</span>::<span class="org-type">any</span> <span class="org-variable-name">index</span> = evaluate(expr-&gt;index);
    <span class="org-keyword">if</span> (name.type() == <span class="org-keyword">typeid</span>(<span class="org-constant">std</span>::<span class="org-type">shared_ptr</span>&lt;ListType&gt;)) {
        <span class="org-keyword">if</span> (index.type() == <span class="org-keyword">typeid</span>(<span class="org-type">double</span>)) {
            <span class="org-constant">std</span>::<span class="org-type">shared_ptr</span>&lt;ListType&gt; <span class="org-variable-name">list</span>;
            <span class="org-type">int</span> <span class="org-variable-name">castedIndex</span>;
            list = <span class="org-constant">std</span>::any_cast&lt;<span class="org-constant">std</span>::<span class="org-type">shared_ptr</span>&lt;ListType&gt;&gt;(name);
            castedIndex = <span class="org-constant">std</span>::any_cast&lt;<span class="org-type">double</span>&gt;(index);
            <span class="org-keyword">if</span> (expr-&gt;value != <span class="org-constant">nullptr</span>) {
                <span class="org-constant">std</span>::<span class="org-type">any</span> <span class="org-variable-name">value</span> = evaluate(expr-&gt;value);
                <span class="org-keyword">if</span> (list-&gt;setAtIndex(castedIndex, value)) {
                    <span class="org-keyword">return</span> value; 
                } <span class="org-keyword">else</span> {
                    <span class="org-keyword">throw</span> RuntimeError{expr-&gt;paren, <span class="org-string">"Index out of range."</span>};
                }
            } <span class="org-keyword">else</span> {
                <span class="org-keyword">if</span> (castedIndex &gt;= list-&gt;length() || castedIndex &lt; 0) {
                    <span class="org-keyword">return</span> <span class="org-constant">nullptr</span>;
                }
                <span class="org-keyword">return</span> list-&gt;getEleAt(castedIndex);
            }
        } <span class="org-keyword">else</span> {
            <span class="org-keyword">throw</span> RuntimeError{expr-&gt;paren, <span class="org-string">"Index should be of type int."</span>};
        }
    } <span class="org-keyword">else</span> {
        <span class="org-keyword">throw</span> RuntimeError{expr-&gt;paren, <span class="org-string">"Only lists can be subscripted."</span>};
    }
    <span class="org-keyword">return</span> {};
}
</pre>
</div>
<p>
I could have made the interpreter throw errors when indexing out of range but chose to return a <code>nullptr</code> because it helps in terminating a loop while iterating over a list. It might seem unsafe but the interpreter throws an error when a variable initialized with <code>nullptr</code> is used in an expression. So if the user tries to access a value out of range and uses it in some other expression, the program is guaranteed to fail. 
</p>
<div class="org-src-container">
<pre class="src src-lox">// lox script to print all elements in a list
var list = [1, 2, 3, 4, 5];
for (var i = 0; list[i] != nil; i = i + 1) {
    print list[i]; // 1 2 3 4 5
}
</pre>
</div>
</div>
</div>
</div>
</section>
<section id="outline-container-orgc76c6b5" class="outline-2">
<h2 id="orgc76c6b5">Unused Variable Warnings</h2>
<div class="outline-text-2" id="text-orgc76c6b5">
<p>
I also made the resolver throw warnings when there are unused variables in the local scope. This also solves challenge #3 in chapter 11 <i>Resolving and Binding</i>.
</p>

<p>
To implement this feature, a vector of <code>std::map</code> is used like a stack to track the nested (possibly) local scopes in scope. This is similar to the <code>scopes</code> stack used in the resolver but instead of storing a string and a boolean, here I store the variable as a token and the number of times it has been resolved. When the resolver enters a local scope it pushes an empty map into the vector and when it exits a scope it pops a map. Declaring a variable in the local scope inserts a element with variable token as key and <code>0</code> as value in the top most map. This value gets incremented by one whenever the corresponding variable is resolved locally. Finally, before exiting a local scope calling <code>checkUnusedVariables()</code> would iterate over all the pairs in the top most map and throw a warning when the value is equivalent to zero.
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span class="org-type">void</span> <span class="org-constant">Resolver</span>::<span class="org-function-name">checkUnusedVariables</span>() {
    <span class="org-constant">std</span>::<span class="org-type">map</span>&lt;Token, <span class="org-type">int</span>&gt; &amp;<span class="org-variable-name">currentScope</span> = identifiers.back();
    <span class="org-keyword">for</span> (<span class="org-keyword">auto</span> <span class="org-keyword">const</span>&amp; [<span class="org-constant">key</span>, <span class="org-constant">val</span>] : currentScope) {
        <span class="org-keyword">if</span> (val == 0) {
            <span class="org-constant">Error</span>::warn(key, <span class="org-string">"Unused local variable."</span>);
        }
    }
}
</pre>
</div>
</div>
</section>
<section id="outline-container-orgdd7f076" class="outline-2">
<h2 id="orgdd7f076">Epilogue</h2>
<div class="outline-text-2" id="text-orgdd7f076">
<p>
I had so much fun working on this project and learnt a lot about programming languages and interpreters. Before reading this book, I did not know what actually happens when I run or compile my programs but now I have a better understanding of the underlying ideas and visualize a interpreter as follows:
</p>

<ol class="org-ol">
<li>Scanner:
Converts user input into list of tokens.</li>
<li>Parser:
Tokens into expression or statement AST node based on formal grammar.</li>
<li>Interpreter:
<ul class="org-ul">
<li>Evaluates a expression node to a value.</li>
<li>Executes a statement node to produce side effect.</li>
</ul></li>
<li>Environment:
Stores the state of the program.</li>
</ol>

<p>
Next, I&rsquo;m looking forward to start working on the bytecode interpreter.
</p>
</div>
</section>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">I&rsquo;m not sure if this would work when classes and methods are implemented.</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">This is actually a bug because index number should not be of type <code>double</code></p></div></div>


</div>
</div></main>
<footer id="postamble" class="status">
<div class='footer'>
  Last updated on 2021-Nov-26 Fri 13:02. <br>
</div>
</footer>
</body>
</html>
